package com.javarush.test.level03.lesson04.task04;

/* Произведение 10 чисел
Вывести на экран произведение 10 чисел от 1 до 10. Результат - 1 число.
Подсказка: будет три миллиона с хвостиком.
*/

public class Solution
{
    public static void main(String[] args)
    {
        //1 var
       // System.out.println(1*1*2*3*4*5*6*7*8*9*10);


        //2 var
       /* int i;
        int n = 1;

        for(i=1; i<=10; i++)
        {

            n = n*i;
        }
        // можно return n;
        System.out.println(n);

        */

       //3 var
       /* int i=1,k=1;
        while (k<=10)
        {
            i=i*k;
            k++;
        }
        System.out.print(i);*/
    }
}